#Запитуємо у користувача день та місяць народження
day = int(input("Введіть день народження: "))
month = int(input("Введіть місяць народження: "))

#Дата гороскопу
if (month == 3 and day >= 21) or (month == 4 and day <= 20):
    zodiak = "Овен"
elif (month == 4 and day >= 21) or (month == 5 and day <= 21):
    zodiak = "Телець"
elif (month == 5 and day >= 22) or (month == 6 and day <= 21):
    zodiak = "Близнята"
elif (month == 6 and day >= 22) or (month == 7 and day <= 22):
    zodiak = "Рак"
elif (month == 7 and day >= 23) or (month == 8 and day <= 21):
    zodiak = "Лев"
elif (month == 8 and day >= 22) or (month == 9 and day <= 23):
    zodiak = "Діва"
elif (month == 9 and day >= 24) or (month == 10 and day <= 23):
    zodiak = "Терези"
elif (month == 10 and day >= 24) or (month == 11 and day <= 22):
    zodiak = "Скорпіон"
elif (month == 11 and day >= 23) or (month == 12 and day <= 21):
    zodiak = "Стрілець"
elif (month == 12 and day >= 22) or (month == 1 and day <= 20):
    zodiak = "Козеріг"
elif (month == 1 and day >= 21) or (month == 2 and day <= 18):
    zodiak = "Водолій"
elif (month == 2 and day >= 19) or (month == 3 and day <= 20):
    zodiak = "Риби"
elif not (1 <= day <= day and 1 <= month <= 12):
    print('Помилка, день або місяць неправильний!')
    exit()

#zodiak ключевое слово
print("Ваш знак зодіаку: ", zodiak)

#о гороскопах
if zodiak == "Овен":
    print("Початок тижня обіцяє бути вдалим. Потрібно тільки бути наполегливим та старанним. \nРезультат буде чудовим у випадку, якщо не пошкодуєте сил на нові звершення.")
elif zodiak == "Телець":
    print("Вам захочеться по-новому поглянути на свою роботу, застосувавши нові \nпідходи більш творчі та менш енерговитратні. Потрібно не упустити цей момент.")
elif zodiak == "Близнята":
    print("Довіряйте сьогодні інтуїції. Її голос підкаже, як зробити правильний вибір. \nВарто в цей день спілкуватися з максимально великою кількістю людей та бути більш активними.")
elif zodiak == "Рак":
    print("Можуть виникнути проблеми з грошима, проте це буде відповідний день для того, щоб все налагодити. \nЗ'явиться можливість поліпшити добробут, якщо помітите хорошу пропозицію.")
elif zodiak == "Лев":
    print("Обставини можуть привести до нестями від гніву. Попри те, що плани зіпсуються, варто тримати себе в руках. \nПотрібна міра, щоб не зіпсувати відносини з іншими.")
elif zodiak == "Діва":
    print("Тримайте власні кордони та не дозволяйте чужим людям псувати день, плани та настрій. \nПрислухайтеся до порад близьких, однак рішення ухвалюйте самостійно.")
elif zodiak == "Терези":
    print("День буде вдалим для творчості, всього, що пов'язано з рукоділлям. \nВідкриються двері для нових ідей, пропозицій, до чого варто придивитися та погодитися.")
elif zodiak == "Скорпіон":
    print("Потрібно стримувати експресію та вміти вчасно зупинятися. \nВажливо з усіх сил намагатися не втрачати контроль над емоціями.")
elif zodiak == "Стрілець":
    print("Будьте готові до того, що день буде непростий. \nНа плечі ляже великий пласт незапланованої роботи, яку треба вирішити в короткий термін. Сконцентруйтеся.")
elif zodiak == "Козеріг":
    print("Для вас все може змінитися несподівано, адже від нових проєктів буде складно відмовитися. \nВиникне можливість кардинально змінити життя.")
elif zodiak == "Водолій":
    print("Можлива зустріч, яка зможе не тільки змінити життя на краще, а й принести великий фінансовий дохід.\n Постарайтеся сьогодні здійснити хоча б одну мрію.")
elif zodiak == "Риби":
    print("Для уникнення конфліктів, максимально мінімізуйте спілкування. \nАстрологи радять спілкуватися мало, тому що будь-яка розмова призведе до розбіжностей та довготривалих конфліктів.")

