import re

password = input("Введіть пароль: ")

score = 0

# Довжина пароля більша або дорівнює 8 символам.
if len(password) >= 8:
    score += 1

# У паролі є хоча б одна цифра
if re.search(r"\d", password):
    score += 1

# У паролі є хоча б одна велика
if re.search(r"[A-Z]", password):
    score += 1

# У паролі є хоча б одна маленька буква
if re.search(r"[a-z]", password):
    score += 1

# У паролі є хоча б один спеціальний символ (+, -, /, _, % і т.д. P.S. їх насправді більше)
if re.search(r"\W", password):
    score += 1

# визначення рівня складності та рекомендації
if score == 0:
    print("Слабкий пароль, рекомендується використовувати паролі, які містять цифри, великі та маленькі букви, а також спеціальні символи.")
elif score == 1:
    print("Пароль достатньо складний, але можливо його потрібно покращити. Для поліпшення, спробуйте використовувати паролі, які містять цифри, великі та маленькі букви.")
elif score == 2:
    print("Пароль середньої складності, спробуйте використовувати паролі, які містять цифри, великі та маленькі букви, а також спеціальні символи.")
elif score == 3:
    print("Пароль досить складний, але він все ще може бути покращений. Спробуйте використовувати довші паролі та змінювати їх частіше.")
elif score == 4:
    print("Дуже складний пароль, але можливо його потрібно змінювати частіше.")
else:
    print("Дуже складний та надійний пароль, продовжуйте зберігати його в безпеці!")

